[
    {
        "name": "ABC",
        "intro": ["Automated Baseball Caster V16.38, now online."],
        "strikeoutlooking": ["{0.batter} strikes out looking."],
        "strikeoutswinging": ["{0.batter} strikes out swinging."],
        "groundout": ["{0.batter} grounds out to {0.defender}."],
        "flyout": ["{0.batter} flies out to {0.defender}."],
        "fielderschoice": ["{0.batter} reaches on fielder's choice. {0.runner} is out at {0.base_string} base."] ,
        "doubleplay": ["{0.batter} grounds into a double play!"],
        "sacrifice": ["{0.batter} hits a sacrifice fly towards {0.defender}."],
        "walk": ["{0.batter} draws a walk."],
        "single": ["{0.batter} hits a single!"],
        "double": ["{0.batter} hits a double!"],
        "triple": ["{0.batter} hits a triple!"],
        "homerun": ["{0.batter} hits a dinger!"],
        "grandslam": ["{0.batter} hits a grand slam!"],
        "steal_caught": ["{0.runner} was caught stealing {0.base_string} base by {0.defender}!"],
        "steal_success": ["{0.runner} steals {} base!"]
    },
    {
        "name": "New Guy",
        "intro": ["Hey, folks! First day, great to be here.",
            "Never played Baseball, or, uh, seen it, but I'm really excited to learn along with you.",
            "Here we go! Uh, how's it go again...",
            "Play baseball!"],
        "strikeoutlooking": ["{0.batter} watches the ball go right past 'em. Think you're supposed to hit it. And they're out.",
            "{0.batter} waits for the bat to start moving on its own, I guess? It doesn't, so... they're out.",
            "{0.batter} doesn't even try to go for the ball, apparently, and they're out."],
        "strikeoutswinging": ["{0.batter} swings, but the ball is already past them! They were off by a mile! They're out.",
            "{0.batter} swings three times, but never actually hits the ball. Out!",
            "{0.batter} swings three times, and it looks like they're headed home! I-in a bad way. As in they're out."],
        "groundout": ["{0.batter} hits the ball! It rolls over to {0.defender}, who's throwing it to first, and... yep. That's an out, I guess.",
            "{0.batter} hits the ball! Nice!! And there they go, running towards first! Wait, since when did {0.defender} have the ball- and, whoops, yeah, they're out at first.",
            "{0.batter} hits the ball right onto the ground. It rolls over to {0.defender}, who nabs it and tosses it to first, and it looks like {0.batter}'s out.",
            "{0.batter} hits the ball over to the right side of the field. And it looks like {0.defender}'s sending it right over to first, where {0.batter}'s out."],
        "flyout": [["{0.batter} knocks the ball real hard right over {0.defender}.","They leap up and catch it! {0.batter} is out!!"],
            "{0.batter} hits the ball super high up in the air! But it drops right into the hands of {0.defender}.",
            ["{0.batter} absolutely SMASHES that ball! It's gone!","Woah, hold on, nevermind. It looks like {0.defender} jumped up and grabbed it!"],
            "{0.batter} bops the ball up in the air and over to {0.defender}. Worth a go, I guess?",
            ["{0.batter} winds up a real heavy hit, and the ball goes really fast!", "Not fast enough to faze {0.defender}, though, who does a spectacular leap over and nabs it out of the air."]],
        "fielderschoice": ["{0.batter} whacks the ball over to the left side of the baseball triangle, where {0.defender} sends {0.fc_out} back to their pit. {0.batter}'s on base, though!",
            ["{0.batter} hits the ball onto the ground, where it rolls over to the second-and-a-half-base guard. They put a stop to {0.fc_out}'s running, but they forgot about {0.batter}!"]],
        "doubleplay": [["{0.batter} hits the ball over to {0.defender}, who picks it up and stops that runner at second.", "And they're not done! They toss it to first and get {0.batter} out, too. Yikes."],
            "{0.batter} hits the ball to {0.defender}, who gets that runner from first out before tossing it right back at first, and... wow. That went as poorly as it could've. They're both out."],
        "sacrifice": [["{0.batter} does a little mini-hit, bumping the ball onto the field. {0.defender}'s got it, and, yeah, they're out at first.", "Wait, when did {0.runner} score? Oh, was that- that was clever! Very nice."],
            "{0.batter} POUNDS the ball right up into the air! It lands right in the hands of {0.defender}, but {0.runner} takes the opportunity to stroll over to the one that gives points!"],
        "walk": ["{0.batter} watches the ball go right past them four times, and... gets to advance? Okay!",
            ["{0.batter} just stands there. The umpire's calling it a ball, which... they're all balls, aren't they? It's baseball, not-", "Oh, uh, right. They're on first now. I guess."],
            "{0.batter} hangs out for four throws, gets bored, and walks over to first. Didn't know you can do that, but good for them!", 
            "{0.batter} gets smacked with the ball! Yikes! They're limping over to first, so... we're... we're just going to keep going, then. Alright!"],
        "single": [["{0.batter} knocks the ball real hard right over {0.defender}.", "And get away with it, too, making it to first long before the ball does!"],
            "{0.batter} hits the ball too hard for anyone to nab it and runs right over to first.",
            "{0.batter} barely brushes up against the ball with the bat, and it lands pretty close to them. A bunch of folks scramble for it, but not before {0.batter} makes it to first!"],
        "double": ["{0.batter} hits the ball super hard, and while everyone's scrambling for it they're off to first! No, second!!",
            "{0.batter} whacks the ball and gets out of there, making it to first and then second before anyone on the field can get the ball near them."],
        "triple": ["{0.batter} obliterates the ball and gets moving! They're at first! No, second! No, they're at third! And... Oh, that's it, they're done. Okay.",
            "{0.batter} hits a three-base baseball whack! They try to go a little extra, but get scared into running back to third. Works."],
        "homerun": ["{0.batter} whacks the ball out of the park!! The crowd's going wild as they run all the way around the baseball triangle and back to zeroth base!",
            ["{0.batter} absolutely SMASHES that ball! It's gone!", "And so are they, as they run all the bases and head right back home!"],
            "{0.batter} hits a home run! Ooh, I know this one!"],
        "grandslam": ["{0.batter} hits the ball and chases all their friends home with them!",
            "{0.batter} whacks the ball onto the ground reeeally far away. {0.defender} gets to it eventually, but not in time to stop ANYONE from making it home!!",
            "{0.batter} hits a quadruple home run!"],
        "steal_success": ["{0.runner} runs to the next base too early!! You can do that??",
            "{0.runner} is cheating!! They just ran to the next base and nobody even hit the ball!",
            "{0.runner} gets bored of waiting and takes off, narrowly making it to the next base!"],
        "steal_caught": ["{0.runner} tries to run to the next base too early, and gets caught cheating!",
            "{0.runner} sees if they can get away with dashing over to the next base. They can't, turns out.",
            "{0.runner} tries running to the next base, but {0.defender}'s ready for them. Out!"]
    },
    {
        "name": "Trespass Oracle",
        "intro": ["Trespass Oracle here for Channel 16, bringing you this game live from... some stadium!"],
        "strikeoutlooking": ["{0.batter} punches out on that one. Strike 3!",
            "{0.batter} stands by like a couch on the side of the road for that ball. Strike 3!",
            "{0.batter} gets caught looking there. Can't take your eyes off the pitcher for a second."],
        "strikeoutswinging": ["{0.batter} whiffs on that last ball and they're outta here! Strike 3!",
            "{0.batter} gets nothing but air on that ball. Strike 3!",
            "{0.batter} squares up for a bunt, two strikes-- and it goes foul! It's gonna be a long walk back to the dugout for {0.batter}."],
        "groundout": ["{0.batter} rolls out the red carpet to {0.defender} on that ball. Easy out.",
            "{0.batter} hits it into shallow right field there, where {0.defender} scoops the ball up and throws it to first. {0.batter} is outta here!",
            "{0.batter} jumps on that pitch and makes a run for it, but {0.defender} throws them out at first!"],
        "flyout": ["{0.batter} hits a fly ball deep into centre field, and {0.defender} catches it!",
            ["{0.batter} hits a high fly into right field--", "{0.defender} dives-- and gets it! {0.batter} is out!"],
            "{0.batter} hits the ball deep into left field-- but {0.defender} says it's not gonna be that easy, and robs them of a home run!",
            ["{0.batter} hits a high fly into right field--", "but {0.defender} dives into the stands to catch it! I've seen it, and I still don't believe what I just witnessed!"]],
        "fielderschoice": ["{0.batter} hits it hard on the ground-- tough play. {0.batter} reaches on fielder's choice!",
            "{0.batter} hits that one shallow, and {0.defender}'s made their choice: {0.runner} is outta here, but {0.defender} reaches!"],
        "doubleplay": ["{0.batter} grounds out into the double play! We really do hate to see it.",
            "{0.batter} rolls out the red carpet to {0.defender}, and they turn the double play. They're making it look easy out there!",
            "{0.batter} hits deep, but {0.defender} throws it into the double play there! Just a well-oiled defensive machine on the field tonight."],
        "sacrifice": [["{0.batter} hits that one deep, and {0.runner} tags up--", "They're safe! Shook hands with danger on that one!"],
            "{0.batter} bunts on that one, letting {0.runner} come home on the sacrifice!",
            "{0.batter} hits a sacrifice fly! {0.runner} tags up to keep this rally alive!"],
        "walk": ["{0.batter} draws a walk on that one. {0.pitcher} must not have wanted to risk it.",
            "{0.batter} makes the walk to first.",
            "{0.batter} gets hit by a beanball-- that one looks like it smarts! They're taking the long way round to First.",
            "{0.batter} draws the walk there. Sometimes you've just gotta take what you can get."],
        "single": ["{0.batter} hits that one shallow, and just makes it before {0.defender} throws to first!",
            "{0.batter} hits the ball deep, with {0.defender} running for it-- but {0.batter} dives to first in the knick of time! This league needs instant replay!",
            "{0.batter} hits that one deep, but {0.defender} is on it like a hawk-- Don't get cocky, kid! {0.batter} puts on the brakes, safe at first with time to spare!"],
        "double": ["{0.batter} hits it deep and makes it to second with time to spare. The most dangerous base!",
            "{0.batter} knocks that one into left field, swiftly rounds first-- and ends up safe at second!",
            "{0.batter} nails the double and stops safe at second! You're halfway home, kid!"],
        "triple": ["{0.batter} puts an exclamation point on that one! Just enough time for {0.batter} to make it to third!",
            "{0.batter} hits a high fly on that one-- {0.defender} runs for it but it hits the grass! {0.batter} makes it to third in the knick of time!",
            "{0.batter} absolutely nails that one-- and safe at third! We love to see it!!",
            "{0.batter} hits that one with authority and makes it to third! But they're still a long way from home!"],
        "homerun": ["{0.batter} hits one deep into left field-- No doubt about it, this one's a Home Run!",
            "{0.batter} hits a high fly deep into right field-- and it's GONE! Home Run!",
            "{0.batter} sends that one right into the stands!! HOME RUN! Wow, they are unbelievable!"],
        "grandslam": ["{0.batter} with the GRAND SLAM! AND THIS IS, INDEED, THE GREATEST NIGHT IN THE HISTORY OF OUR SPORT.",
            "{0.batter} with a high fly into right field there-- and it's GONE! That's a GRAND SLAM!",
            "{0.batter} with the GRAND SLAM! And if you had any dobuts about them, that should put them to rest right there!"],
        "steal_caught": ["{0.runner} was caught stealing {0.base_string} base by {0.defender}!"],
        "steal_success": ["{0.runner} steals {0.base_string} base!"]
    }
]